org/org-docs/software-test/software-test.org
# * (ソフトウェア) テスト
原著: [[http://www.itmedia.co.jp/im/articles/1111/07/news192.html][情報システム用語事典：ソフトウェアテスト（そふとうぇあてすと）]]

コンピュータのソフトウェアプログラムを実行し、それが意図したとおりに動
くかを観測・評価・検証する作業のこと。

** ソフトウェアテストを行う目的

- *欠陥やバグを検出する*
- *要件を満たすことを保証する*
- リリース後の品質リスクを見積もる
- 開発プロセス改善の指標となる

どの目的を重視するかは、開発するソフトウェアプロダクトの目的やニーズ、
開発組織の成熟度などによって変わってくる。

** ソフトウェア開発におけるテスト

- ユーザーの使用状況を反映した入力データを用いてソフトウェアを実行し、
- 事前に想定した結果と実際の実行結果をつき合わせて合否の判定を行う。

*** テストとテストケース

このテスト用の *入力データ* とそれを実行したら得られるであろう *事前に
想定した結果* の対を *テストケース* という。

テストケースを使って対象を実行してみる行為がテストである。

*** テストされていないプログラム

正しい動作を保証されず、実際に高い確率で正しく動作しない。

したがってソフトウェア開発において、でき得る限り網羅的にテストを行うべ
きであり、テスト自体は必須の工程と位置付けられてきた。

しかしながら、ソフトウェア開発の黎明期から「完全なテスト」の困難性が指
摘されている。

*** テストの複雑さ

実用レベルの複雑さ（規模）を持つソフトウェアの場合、“入力データ”と
“実行結果”の組み合わせは事実上無限となる。

また、環境に依存する機能では、環境との組み合わせも発生する。

このため、ほとんどのテストは無限の組み合わせに対して有限個のテストケー
スをあてがう作業であって、完全なテストにはならないのである。

** ソフトウェアテストの技法や手法

*** ソフトウェアテストの主な分類  

**** テストレベル（開発フェイズ）による分類 

- 単体テスト
- 結合テスト
- システムテスト
- 受け入れテスト
- 回帰テスト
- スモークテスト  
 
**** テスト設計技法による分類 

- 構造ベース技法 （制御パステスト、データフローパステストなど）  
- 仕様ベース技法 （同値分割、 境界値分析、 原因結果グラフ技法、 状態遷
  移テスト、ユースケーステスト、ドメイン分析テスト、組み合わせテスト／
  ペア構成テストなど）
- 経験ベース技法 （エラー推測、 探索的テスト、 アドホックテスト、 ラン
  ダムテストなど）

テスト設計テクニックによる分類: 

- ホワイトボックステスト
- ブラックボックステスト 
- グレーボックステスト

***** テスト対象となる品質特性による分類 

- 機能テスト  

- 非機能テスト 
  - 性能テスト
  - 負荷テスト
  - ユーザビリティテスト
  - 相互運用性テスト
  - 保守性テスト
  - 信頼性テスト
  - 移植性テスト

***** テスト実施者、テスト目的による分類 

- デベロッパテスト
- カスタマテスト
- 品質保証テスト  


*** テストの一般原則

ソフトウェアテストの世界には、長年の経験をまとめた7つの一般原則がある。

- 原則1　テストは欠陥があることしか示せない。
  
  欠陥がないことを証明できない

- 原則2　全数テストは不可能。

  ごく単純なソフトウェア以外は、すべての条件をテストすることは非現実的
  である

- 原則3　初期テスト。

  テストは開発ライフサイクルの早い時期に開始すべきである

- 原則4　欠陥の偏在。

  テストで見つかる欠陥の大部分は、特定の部分に集中する

- 原則5　殺虫剤のパラドックス。

  同じテストを何度も繰り返すと、そのテストでは新しいバグを見つけられな
  くなる

- 原則6　テストは条件次第。

  ソフトウェアの要件が異なれば、テストの方法も変わる

- 原則7　「バグゼロ」の落とし穴

  仮にバグがゼロだとしても、要求を満たしていなければ、そのシステムは役
  に立たない

** バイザーのテスト成熟度

- レベル0  テストとは、デバッグのことである  
- レベル1  テストの目的は、ソフトウェアが正常に働くことを示すことである  
- レベル2  テストの目的は、ソフトウェアが正常に働かないことを示すことで
  ある
- レベル3  テストの目的は、ソフトウェアが正常に働かないことで生じるリス
  クを許容値まで下げることである
- レベル 4 テストとは、高品質のソフトウェアを開発しようという精神的な規
  律である

